#### 0501_Lab  
1. Cleanse categorical data in the Student table in BTech22_\<your name\>.sqlite.

In [1]:
import pandas as pd
import os
import sqlite3 as lite
from glob import glob

dbpath = 'BTech22_reethurgt.sqlite'
con = lite.connect(dbpath)
cursor = con.cursor()

In [2]:
df=pd.read_excel("/Users/reethu/coding/college/DBMS/Data/BTech22 Data.xlsx")
df

,USN,Name,Email,Section,Sex,DoB,Height_cm,Weight_Kg,Home_State,Home_Town,Mother_Tongue,Elective,Clubs
0,1RVU22CSE001,SHREE VYSHNAVI A,shreevyshnavia,B,Female,14/04/2005,158,56,Karnataka,Mysore,Telugu,Photography,Generative AI
1,1RVU22CSE002,AARON ARTHUR ELISHA,aarone,A,Male,2003-04-02 00:00:00,183,76,NaN,NaN,English,Community service,NaN
2,1RVU22CSE003,ABHISHEK,abhishek,A,Male,2003-08-05 00:00:00,181,56,Karnataka,Bidar,Marathi,Photography,NaN
3,1RVU22CSE004,ABRAR HUSSAIN,abrarh,B,Male,21/11/2003,182,69,Jammu,Bathindi,Urdu,Drumming,E-Cell
4,1RVU22CSE005,ADITI A,aditia,B,Female,13-3-2004,157,NaN,Karnataka,Ballari,Kannada,Photography,"Generative AI, Expressions, Kalakriti"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
187,1RVU22CSE189,VIBHU POTTEKULA,vibhup,C,Male,18/03/04,172,56,Karnataka,Bengaluru,Kannada,Photography,Viksha
188,1RVU22CSE190,VIJAY SHARMITH,vijays,B,Male,2004-05-04 00:00:00,176,55,Karnataka,Bengaluru,Tamil,"Success, Happiness and Leadership","Cybersecurity, Neural Nexus club"
189,1RVU22CSE191,VIKASH KASHYAP,vikashk,A,Male,13/05/2003,178,85,Karnataka,Banglore,Kannada,Drumming,NaN
190,1RVU22CSE192,VISMITHA PRIYANKA,vismithap,A,Female,25/06/2004,160,54,Karnataka,Bangalore,kannada,Drumming,"cybersecurity, Neural Nexus ,Viksha"
191,1RVU22CSE193,YASHWANTH BU,yashwanthbu,A,Male,28/07/2004,179,80,Karnataka,Bangalore,Kannada,Photography,carvaccess(rvce)

In [3]:
con.execute("CREATE TABLE Students(USN TEXT, Name TEXT, Email TEXT, Section	TEXT, Sex TEXT, DoB	TEXT, Height_cm	INTEGER, Weight_Kg INTEGER, Home_State TEXT, Home_Town TEXT, Mother_Tongue TEXT, Elective TEXT, Clubs TEXT,  PRIMARY KEY (USN))")

In [4]:
excel_data = pd.read_excel("/Users/reethu/coding/college/DBMS/Data/BTech22 Data.xlsx")

# Establish a database connection
conn = lite.connect('your_database.db')


# Prepare SQL INSERT statement
insert_sql = "INSERT INTO Students(USN, Name, Email, Section, Sex, DoB, Height_cm, Weight_Kg, Home_State, Home_Town, Mother_Tongue, Elective, Clubs) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)"

# Iterate over Excel data and insert into the database
for index, row in excel_data.iterrows():
    values = (row['USN'], row['Name'], row['Email'], row['Section'], row['Sex'], row['DoB'], row['Height_cm'], row['Weight_Kg'], row['Home_State'], row['Home_Town'], row['Mother_Tongue'], row['Elective'], row['Clubs'])
    cursor.execute(insert_sql, values)
    
con.commit()

In [5]:
con.execute("SELECT * FROM sqlite_master").fetchall()

[('table',
  'Students',
  'Students',
  2,
  'CREATE TABLE Students(USN TEXT, Name TEXT, Email TEXT, Section\tTEXT, Sex TEXT, DoB\tTEXT, Height_cm\tINTEGER, Weight_Kg INTEGER, Home_State TEXT, Home_Town TEXT, Mother_Tongue TEXT, Elective TEXT, Clubs TEXT,  PRIMARY KEY (USN))'),
 ('index', 'sqlite_autoindex_Students_1', 'Students', 3, None)]

In [6]:
pd.read_sql("SELECT COUNT(*) FROM Students", con)

   COUNT(*)
0       192

In [7]:
pd.read_sql("PRAGMA table_info(Students)", con)

    cid           name     type  notnull dflt_value  pk
0     0            USN     TEXT        0       None   1
1     1           Name     TEXT        0       None   0
2     2          Email     TEXT        0       None   0
3     3        Section     TEXT        0       None   0
4     4            Sex     TEXT        0       None   0
5     5            DoB     TEXT        0       None   0
6     6      Height_cm  INTEGER        0       None   0
7     7      Weight_Kg  INTEGER        0       None   0
8     8     Home_State     TEXT        0       None   0
9     9      Home_Town     TEXT        0       None   0
10   10  Mother_Tongue     TEXT        0       None   0
11   11       Elective     TEXT        0       None   0
12   12          Clubs     TEXT        0       None   0

In [8]:
con.execute("SELECT DISTINCT Home_State FROM Students").fetchall()

[('Karnataka ',),
 (None,),
 ('Karnataka',),
 ('Jammu',),
 ('Haryana',),
 ('karnataka ',),
 ('Delhi',),
 ('karnataka',),
 ('West Bengal',),
 ('Andhra Pradesh',),
 ('Telangana',),
 ('Punjab',),
 ('Goa',),
 ('Uttar Pradesh',),
 ('Rajasthan ',),
 ('Tamil Nadu',),
 ('Bihar',),
 ('Nil ',),
 ('Andhra Pradesh ',),
 ('Uttar Pradesh ',),
 ('KARNATAKA',),
 ('karntaka',),
 ('Gujarat',),
 ('Jharkhand',),
 ('-',),
 ('Rajasthan',),
 ('KARnataka',),
 ('Punjab ',),
 ('Karantaka',)]

In [9]:
query1 = """
    UPDATE Students
    SET Home_State = TRIM(Home_State)
"""
query2 = """
    UPDATE Students
    SET Home_State = 'Karnataka'
    WHERE Home_State IN
    ('karnataka','KARNATAKA','karntaka','KARnataka','Karantaka')
"""
query3 = """
    UPDATE Students
    SET Home_State = 'unknown'
    WHERE Home_State IN ('unknown', '-', 'Nil', 'None')
"""
query4 = """
    UPDATE Students
    SET Home_State = 'unknown'
    WHERE Home_State IS NULL;
"""

con.execute(query1)
con.execute(query2)
con.execute(query3)
con.execute(query4)
con.commit()

con.execute("SELECT DISTINCT Home_State FROM Students").fetchall()

[('Karnataka',),
 ('unknown',),
 ('Jammu',),
 ('Haryana',),
 ('Delhi',),
 ('West Bengal',),
 ('Andhra Pradesh',),
 ('Telangana',),
 ('Punjab',),
 ('Goa',),
 ('Uttar Pradesh',),
 ('Rajasthan',),
 ('Tamil Nadu',),
 ('Bihar',),
 ('Gujarat',),
 ('Jharkhand',)]

In [10]:
con.execute("SELECT DISTINCT Mother_Tongue FROM Students").fetchall()

[('Telugu',),
 ('English ',),
 ('Marathi',),
 ('Urdu',),
 ('Kannada',),
 ('Hindi',),
 (None,),
 ('kannada',),
 ('Kannada ',),
 ('Hinglish',),
 ('Marathi ',),
 ('Konkani',),
 ('Tamil',),
 ('Malayalam',),
 ('Hindi ',),
 ('kannada ',),
 ('tamil',),
 ('Tulu',),
 ('Karnataka',),
 ('MARATHI',),
 ('hindi',),
 ('telugu',),
 ('Gujarati',),
 ('Telugu ',),
 ('-',),
 ('KANNADA',),
 ('Punjabi',),
 ('Urdu ',),
 ('ಕನ್ನಡ',)]

In [11]:
query1 = """
    UPDATE Students
    SET Mother_Tongue = TRIM(Mother_Tongue)
"""
query2 = """
    UPDATE Students
    SET Mother_Tongue = 'Telugu'
    WHERE Mother_Tongue = 'telugu'
"""
query3 = """
    UPDATE Students
    SET Mother_Tongue = 'Kannada'
    WHERE Mother_Tongue IN ('KANNADA','ಕನ್ನಡ','Karnataka','kannada')
"""
query4 = """
    UPDATE Students
    SET Mother_Tongue = 'Marathi'
    WHERE Mother_Tongue = 'MARATHI'
"""
query5 = """
    UPDATE Students
    SET Mother_Tongue = 'Hindi'
    WHERE Mother_Tongue = 'hindi'
"""
query6 = """
    UPDATE Students
    SET Mother_Tongue = 'Tamil'
    WHERE Mother_Tongue = 'tamil'
"""
query7 = """
    UPDATE Students
    SET Mother_Tongue = 'unknown'
    WHERE Mother_Tongue IN ('unknown', '-', 'Nil', 'None')
"""
query8 = """
    UPDATE Students
    SET Mother_Tongue = 'unknown'
    WHERE Mother_Tongue IS NULL;
"""

con.execute(query1)
con.execute(query2)
con.execute(query3)
con.execute(query4)
con.execute(query5)
con.execute(query6)
con.execute(query7)
con.execute(query8)
con.commit()
con.execute("SELECT DISTINCT Mother_Tongue FROM Students").fetchall()

[('Telugu',),
 ('English',),
 ('Marathi',),
 ('Urdu',),
 ('Kannada',),
 ('Hindi',),
 ('unknown',),
 ('Hinglish',),
 ('Konkani',),
 ('Tamil',),
 ('Malayalam',),
 ('Tulu',),
 ('Gujarati',),
 ('Punjabi',)]

In [14]:
con.execute("SELECT DISTINCT Home_Town FROM Students").fetchall()

[('Mysore',),
 (None,),
 ('Bidar',),
 ('Bathindi',),
 ('Ballari',),
 ('banglore',),
 ('Raichur',),
 ('Hubballi',),
 ('Bangalore',),
 ('Mandya',),
 ('Chitradurga',),
 ('Gulbarga',),
 ('Bengaluru',),
 ('Maahishmati',),
 ('Hospet',),
 ('New Delhi',),
 ('banglre',),
 ('Dharwad',),
 ('Kalaburgi',),
 ('Kolkata',),
 ('Tirupati',),
 ('chikkamagaluru',),
 ('Shivmogga',),
 ('Banglire',),
 ('Hyderabad',),
 ('Adoni',),
 ('Nagoor',),
 ('Amritsar',),
 ('Goa',),
 ('Bidadi',),
 ('Saharanpur',),
 ('Abu Road',),
 ('Hosapete',),
 ('Chennai',),
 ('Haveri',),
 ('Yadgiri',),
 ('tumkur',),
 ('bangaluru',),
 ('Chithradurga',),
 ('Dharbanga',),
 ('Davengere',),
 ('Nil',),
 ('Shivamogga',),
 ('chitradurga',),
 ('bengaluru',),
 ('chikmagalur',),
 ('mandya',),
 ('Lucknow',),
 ('BIDAR',),
 ('shimoga',),
 ('Banglore',),
 ('shivamogga',),
 ('Chikkaballapur',),
 ('Yadgir',),
 ('Chickmagalur',),
 ('Gangavathi',),
 ('Vijayapura',),
 ('Ahmedabad',),
 ('Mysuru',),
 ('Chikmagalur',),
 ('Hubli',),
 ('Chittoor',),
 ('Mudigere',),
 ('kolar',),
 ('Gajendragad',),
 ('Tumkur',),
 ('Jamshedpur',),
 ('-',),
 ('Belgavi',),
 ('Hassan',),
 ('Mangalore',),
 ('SHIVAMOGGA',),
 ('Magadi',),
 ('bangalore',),
 ('Ananthapur',),
 ('Vijayapur',),
 ('Belgaum',),
 ('Jaipur',)]

In [32]:
query1 = """
    UPDATE Students
    SET Home_Town = TRIM(Home_Town)
"""
query2 = """
    UPDATE Students
    SET Home_Town = 'Bengaluru'
    WHERE Home_Town IN ('banglore', 'Bangalore', 'banglre', 'Banglire', 'bangaluru', 'bengaluru', 'Banglore', 'bangalore')
"""
query3 = """
    UPDATE Students
    SET Home_Town = 'Mysuru'
    WHERE Home_Town = 'Mysore'
"""
query4 = """
    UPDATE Students
    SET Home_Town = 'Mandya'
    WHERE Home_Town = 'mandya'
"""
query5 = """
    UPDATE Students
    SET Home_Town = 'Chitradurga'
    WHERE Home_Town IN ('chitradurga', 'Chithradurga')
"""
query6 = """
    UPDATE Students
    SET Home_Town = 'Chikkamagaluru'
    WHERE Home_Town IN ('Chikmagalur', 'chikkamagaluru', 'chikmagalur', 'Chickmagalur')
"""
query7 = """
    UPDATE Students
    SET Home_Town = 'Shivamogga'
    WHERE Home_Town IN ('shimoga', 'Shivmogga', 'shivamogga', 'SHIVAMOGGA')
"""
query8 = """
    UPDATE Students
    SET Home_Town = 'Tumkur'
    WHERE Home_Town = 'tumkur'
"""
query9 = """
    UPDATE Students
    SET Home_Town = 'Bidar'
    WHERE Home_Town = 'BIDAR'
"""
query10 = """
    UPDATE Students
    SET Home_Town = 'Hubballi'
    WHERE Home_Town = 'Hubli'
"""
query11 = """
    UPDATE Students
    SET Home_Town = 'Kolar'
    WHERE Home_Town = 'kolar'
"""
query12 = """
    UPDATE Students
    SET Home_Town = 'Belagavi'
    WHERE Home_Town = 'Belgaum'
"""
query13 = """
    UPDATE Students
    SET Home_Town = 'Vijayapura'
    WHERE Home_Town = 'Vijayapur'
"""
query14 = """
    UPDATE Students
    SET Home_Town = 'Hosapete'
    WHERE Home_Town = 'Hospet'
"""
query15 = """
    UPDATE Students
    SET Home_Town = 'Yadgiri'
    WHERE Home_Town = 'Yadgir'
"""
query16 = """
    UPDATE Students
    SET Home_Town = 'unknown'
    WHERE Home_Town IN ('unknown', '-', 'Nil', 'None')
"""
query17 = """
    UPDATE Students
    SET Home_Town = 'unknown'
    WHERE Home_Town IS NULL;
"""

con.execute(query1)
con.execute(query2)
con.execute(query3)
con.execute(query4)
con.execute(query5)
con.execute(query6)
con.execute(query7)
con.execute(query8)
con.execute(query9)
con.execute(query10)
con.execute(query11)
con.execute(query12)
con.execute(query13)
con.execute(query14)
con.execute(query15)
con.execute(query16)
con.execute(query17)
con.commit()
con.execute("SELECT DISTINCT Home_Town FROM Students").fetchall()

[('Mysuru',),
 ('unknown',),
 ('Bidar',),
 ('Bathindi',),
 ('Ballari',),
 ('Bengaluru',),
 ('Raichur',),
 ('Hubballi',),
 ('Mandya',),
 ('Chitradurga',),
 ('Gulbarga',),
 ('Maahishmati',),
 ('Hosapete',),
 ('New Delhi',),
 ('Dharwad',),
 ('Kalaburgi',),
 ('Kolkata',),
 ('Tirupati',),
 ('Chikkamagaluru',),
 ('Shivamogga',),
 ('Hyderabad',),
 ('Adoni',),
 ('Nagoor',),
 ('Amritsar',),
 ('Goa',),
 ('Bidadi',),
 ('Saharanpur',),
 ('Abu Road',),
 ('Chennai',),
 ('Haveri',),
 ('Yadgiri',),
 ('Tumkur',),
 ('Dharbanga',),
 ('Davengere',),
 ('Lucknow',),
 ('Chikkaballapur',),
 ('Gangavathi',),
 ('Vijayapura',),
 ('Ahmedabad',),
 ('Chittoor',),
 ('Mudigere',),
 ('Kolar',),
 ('Gajendragad',),
 ('Jamshedpur',),
 ('Belgavi',),
 ('Hassan',),
 ('Mangalore',),
 ('Magadi',),
 ('Ananthapur',),
 ('Belagavi',),
 ('Jaipur',)]

In [19]:
con.execute("SELECT DISTINCT Elective FROM Students").fetchall()

[('Photography ',),
 ('Community service ',),
 ('Photography',),
 ('Drumming',),
 ('Community service',),
 ('Indian Knowledge System: Mathematica and Ayurveda',),
 ('Success, Happiness and Leadership',),
 ('Hindusthani Vocals',),
 ('Contemporary dance ',),
 (None,),
 ('Contemporary ance',),
 ('Contemporary Dance',),
 ('contemporary dance',),
 ('Mixed martial arts',),
 ('Success,Happiness,Leadership and Lifeskills',),
 ('Community Service',),
 ('Community Service ',),
 ('photography',),
 ('Success, Hapiness and Leadership',),
 ('Quantitative Reasoning',),
 ('Quantitative reasoning',),
 ('Indian Knowledge systems - Ayurveda and Mathematics',),
 ('Success, Happiness and Leadership ',),
 ('Quantity Reasoning ',),
 ('success, happiness and leadership and life skills ',),
 ('Hindustani Vocals',),
 ('Contemporary dance',),
 ('Success,Happiness,Leadership and  life skills',),
 ('Hindustani vocals ',),
 ('Null',),
 ('success, happiness and leadership',),
 ('success,happiness,leadership and life skills',),
 ('community servive',),
 ('drumming',),
 ('Kuchipudi',),
 ('community service',),
 ('photography ',),
 ('Success, happiness,leadership and life skills',),
 ('Hindustani Music ',),
 ('Indian Knowledge system Mathematics&Ayurveda',),
 ('deciding ',),
 ('Success, leadership and lifeskill',),
 ('-',),
 ('Success,Leadership and Lifeskill',),
 ('Drumming ',),
 ('PHOTOGRAPHY',),
 ('kuchipudi ',),
 ('quantitative reasoning ',)]

In [27]:
query1 = """
    UPDATE Students
    SET Elective = TRIM(Elective)
"""
query2 = """
    UPDATE Students
    SET Elective = 'Photography'
    WHERE Elective IN ('photography', 'PHOTOGRAPHY')
"""
query3 = """
    UPDATE Students
    SET Elective = 'Community Service'
    WHERE Elective IN ('Community service','community servive','community service')
"""
query4 = """
    UPDATE Students
    SET Elective = 'Indian Knowledge System: Mathematics and Ayurveda'
    WHERE Elective IN ('Indian Knowledge System: Mathematica and Ayurveda','Indian Knowledge systems - Ayurveda and Mathematics','Indian Knowledge system Mathematics&Ayurveda')
"""
query5 = """
    UPDATE Students
    SET Elective = 'Success, Happiness, Leadership and Lifeskills'
    WHERE Elective IN ('Success,Happiness,Leadership and Lifeskills', 'Success, Happiness and Leadership', 'Success, Hapiness and Leadership','success, happiness and leadership and life skills','Success,Happiness,Leadership and  life skills','success, happiness and leadership','success,happiness,leadership and life skills','Success, happiness,leadership and life skills','Success, leadership and lifeskill','Success,Leadership and Lifeskill')
"""
query6 = """
    UPDATE Students
    SET Elective = 'Hindusthani Vocals'
    WHERE Elective IN ('Hindustani Vocals', 'Hindustani vocals', 'Hindustani Music')
"""
query7 = """
    UPDATE Students
    SET Elective = 'Contemporary Dance'
    WHERE Elective IN ('Contemporary ance', 'Contemporary dance','contemporary dance')
"""
query8 = """
    UPDATE Students
    SET Elective = 'Quantitative Reasoning'
    WHERE Elective IN ('Quantitative reasoning','quantitative reasoning','Quantity Reasoning')
"""
query9 = """
    UPDATE Students
    SET Elective = 'Kuchipudi'
    WHERE Elective = 'kuchipudi'
"""
query10 = """
    UPDATE Students
    SET Elective = 'Drumming'
    WHERE Elective = 'drumming'
"""
query11 = """
    UPDATE Students
    SET Elective = 'unknown'
    WHERE Elective IN ('unknown', '-', 'Nil', 'None','deciding')
"""
query12 = """
    UPDATE Students
    SET Elective = 'unknown'
    WHERE Elective IS NULL;
"""

con.execute(query1)
con.execute(query2)
con.execute(query3)
con.execute(query4)
con.execute(query5)
con.execute(query6)
con.execute(query7)
con.execute(query8)
con.execute(query9)
con.execute(query10)
con.execute(query11)
con.execute(query12)
con.commit()
con.execute("SELECT DISTINCT Elective FROM Students").fetchall()

[('Photography',),
 ('Community Service',),
 ('Drumming',),
 ('Indian Knowledge System: Mathematics and Ayurveda',),
 ('Success, Happiness, Leadership and Lifeskills',),
 ('Hindusthani Vocals',),
 ('Contemporary Dance',),
 ('unknown',),
 ('Mixed martial arts',),
 ('Quantitative Reasoning',),
 ('Null',),
 ('Kuchipudi',)]

2. Create look-up tables (aka master tables) for states, towns, and languages.    
Insert data.     
See [RTO Codes](https://www.v3cars.com/car-guide/state-code-regional-transport-office-rto-india) and 
Census Codes for [States and Cities](https://censusindia.gov.in/nada/index.php/catalog/42648) and 
[Language Codes](https://censusindia.gov.in/nada/index.php/catalog/42561)  
Use standard codes or abbreviations as PK.

In [30]:
con.execute("CREATE TABLE Master_Lang(Language TEXT, Language_Code TEXT, PRIMARY KEY(Language))")
con.execute("CREATE TABLE Master_State(State TEXT, State_Code TEXT, PRIMARY KEY(State))")
con.execute("CREATE TABLE Master_City(City TEXT, State_code TEXT, District_code TEXT, PRIMARY KEY(City))")
con.execute("CREATE TABLE Master_Elective(Elective TEXT, Elective_code TEXT, PRIMARY KEY(Elective))")
con.execute("CREATE TABLE Master_Club(Club TEXT, Clubs_code TEXT, PRIMARY KEY(Club))")

In [31]:
rows1 = [('Karnataka','KA'),
 ('Jammu','JK'),
 ('Haryana','HR'),
 ('Delhi','DL'),
 ('West Bengal','WB'),
 ('Andhra Pradesh','AP'),
 ('Telangana','TS'),
 ('Punjab','PB'),
 ('Goa','GA'),
 ('Uttar Pradesh','UP'),
 ('Rajasthan','RJ'),
 ('Tamil Nadu','TN'),
 ('Bihar','BR'),
 ('Gujarat','GJ'),
 ('Jharkhand','JH'), 
 ('Unknown','Unknown')]

con.executemany("INSERT INTO Master_State(State, State_Code) VALUES(?,?)",rows1)

In [33]:
rows2 = [('Mysuru',577, 5572),
 ('Bengaluru',572,000),
 ('Bidar',574,5558),
 ('Bathindi',0,0),
 ('Ballari',572,54432),
 ('Raichur',559,000),
 ('Hubballi',562,5475),
 ('Mandya',573,550),
 ('Chitradurga',566,000),
 ('Kalaburgi',677,2322),
 ('Maahishmati',720,13455),
 ('Hosapete',554,23111),
 ('New Delhi',1,000),
 ('Dharwad',563,65443),
 ('Kolkata',456,12364),
 ('Tirupati',245,13453),
 ('Chikkamagaluru',533,4546),
 ('Shivamogga',523,12253),
 ('Hyderabad',252,6553),
 ('Adoni',765,3312),
 ('Nagoor',332,75234),
 ('Amritsar',124,32345),
 ('Goa',597,6536),
 ('Bidadi',553,13443),
 ('Saharanpur',311,564),
 ('Abu Road',00,00),
 ('Chennai',653,13354),
 ('Haveri',524,43543),
 ('Yadgiri',592,93489),
 ('Tumkur',642,45211),
 ('Dharbanga',674,7653),
 ('Davengere',906,46222),
 ('Lucknow',567,13534),
 ('Chikkaballapur',876,56533),
 ('Gangavathi',977,3132),
 ('Ahmedabad',1333,6756),
 ('Chittoor',233,5676),
 ('Mudigere',133,65655),
 ('Kolar',454,43544),
 ('Gajendragad',565,2323),
 ('Jamshedpur',565,7654),
 ('Belagavi',554,5643),
 ('Hassan',243,56765),
 ('Mangalore',231,56754),
 ('Magadi',654,24353),
 ('Ananthapur',657,2345),
 ('Vijayapura',765,52324),
 ('Jaipur',675,23475),
 ('unknown',00,00)]

con.executemany("INSERT INTO Master_City(City, State_Code, District_code) VALUES(?,?,?)",rows2)

In [36]:
rows3 = [('Telugu','Te'),
 ('English','En'),
 ('Marathi','Mr'),
 ('Urdu','Ur'),
 ('Kannada','Kn'),
 ('Hindi','Hi'),
 ('Hinglish','He'),
 ('Konkani','Ko'),
 ('Tamil','Ta'),
 ('Malayalam','Ml'),
 ('Tulu','Tl'),
 ('Gujarati','Gu'),
 ('Punjabi','Pa')]

con.executemany("INSERT INTO Master_Lang(Language, Language_Code) VALUES(?,?)",rows3)

In [37]:
query1 = """
  UPDATE Students
     SET Home_State = Master_State.State_code
     FROM Master_State
        WHERE Master_State.State = Students.Home_State
"""
con.execute(query1)
query2 = """
    ALTER TABLE Students
    RENAME COLUMN Home_State TO State_ID;
"""
con.execute(query2)
con.commit()

In [38]:
pd.read_sql("SELECT Name, Section, State_ID FROM Students", con)

                    Name Section State_ID
0       SHREE VYSHNAVI A       B       KA
1    AARON ARTHUR ELISHA       A  unknown
2               ABHISHEK       A       KA
3          ABRAR HUSSAIN       B       JK
4                ADITI A       B       KA
..                   ...     ...      ...
187      VIBHU POTTEKULA       C       KA
188       VIJAY SHARMITH       B       KA
189       VIKASH KASHYAP       A       KA
190    VISMITHA PRIYANKA       A       KA
191         YASHWANTH BU       A       KA

[192 rows x 3 columns]

In [39]:
query1 = """
  UPDATE Students
     SET Mother_Tongue = Master_Lang.Language_code
     FROM Master_Lang
        WHERE Master_Lang.Language = Students.Mother_Tongue
"""
con.execute(query1)
query2 = """
    ALTER TABLE Students
    RENAME COLUMN Mother_Tongue TO Language_ID;
"""
con.execute(query2)
con.commit()

In [40]:
pd.read_sql("SELECT Name, Section, Language_ID FROM Students", con)

                    Name Section Language_ID
0       SHREE VYSHNAVI A       B          Te
1    AARON ARTHUR ELISHA       A          En
2               ABHISHEK       A          Mr
3          ABRAR HUSSAIN       B          Ur
4                ADITI A       B          Kn
..                   ...     ...         ...
187      VIBHU POTTEKULA       C          Kn
188       VIJAY SHARMITH       B          Ta
189       VIKASH KASHYAP       A          Kn
190    VISMITHA PRIYANKA       A          Kn
191         YASHWANTH BU       A          Kn

[192 rows x 3 columns]

3. Create tables for electives and clubs.  
    Their PK may be auto-incremented.  
    Insert data.

In [43]:
rows4 = [(1,'Photography'),
 (2,'Community Service '),
 (3,'Drumming'),
 (4,'Indian Knowledge System: Mathematics and Ayurveda'),
 (5,'Success, Happiness, Leadership and Lifeskill'),
 (6,'Hindusthani Vocals'),
 (7,'Contemporary Dance'),
 (8,'Mixed martial arts'),
 (9,'Kuchipudi'),
 (10,'Quantitative Reasoning'),
 (11,'unknown')]
con.executemany("INSERT INTO Master_Elective(ELective_code, Elective) VALUES(?,?)", rows4)

In [44]:
pd.read_sql("SELECT * FROM Master_Elective",con)

                                             Elective Elective_code
0                                         Photography             1
1                                  Community Service              2
2                                            Drumming             3
3   Indian Knowledge System: Mathematics and Ayurveda             4
4        Success, Happiness, Leadership and Lifeskill             5
5                                  Hindusthani Vocals             6
6                                  Contemporary Dance             7
7                                  Mixed martial arts             8
8                                           Kuchipudi             9
9                              Quantitative Reasoning            10
10                                            unknown            11

In [28]:
club = [(1,'Cybersecurity'),
        (2,'Neural Nexus'),
        (3,'Viksha'),
        (4,'Callisto'),
        (5,'ಶ್ರೀಗಂಧ'),
        (6,'ChipTech'),
        (7,'Carvaccess'),
        (8,'E-cell'),
        (9,'Expressions'),
        (10,'Raag'),
        (11,'Future-Axis'),
        (12,'Q-Pulse'),
        (13,'Rowlings Elf'),
        (14,'Socials'),
        (15,'AMEYA'),
        (16,'Debsoc'),
        (17,'Happy Tails')]

In [29]:
con.executemany("INSERT INTO Master_Club(ID, Club) VALUES(?,?)",club)

In [30]:
pd.read_sql("SELECT * FROM Master_Club",con)

    ID                     Club
0    1            cybersecurity
1    2             Neural Nexus
2    3                   Viksha
3    4  callisto astronomy club
4    5                  ಶ್ರೀಗಂಧ
5    6   Possessor Architecture
6    7         carvaccess(rvce)
7    8                   E-cell
8    9              expressions
9   10                     Raag
10  11            generative AI
11  12                  Q-Pulse
12  13             Rowlings Elf
13  14                  Socials
14  15                    AMEYA
15  16                   Debsoc
16  17              Happy tails

In [55]:
con.commit()
con.close()